wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_cla.c
    interrupt_flag_register = CLA_INTF;
    
    switch(flag){
        case CLA_FLAG_CLA0NF:
             intf = (interrupt_flag_register & CLA_INTF_CLA0NF);
             break;
        case CLA_FLAG_CLA0PF:
             intf = (interrupt_flag_register & CLA_INTF_CLA0PF) >> 1U;
             break;
        case CLA_FLAG_CLA1NF:
             intf = (interrupt_flag_register & CLA_INTF_CLA1NF) >> 2U;
             break;
        case CLA_FLAG_CLA1PF:
             intf = (interrupt_flag_register & CLA_INTF_CLA1PF) >> 3U;
             break;
        case CLA_FLAG_CLA2NF:
             intf = (interrupt_flag_register & CLA_INTF_CLA2NF) >> 4U;
             break;
        case CLA_FLAG_CLA2PF:
             intf = (interrupt_flag_register & CLA_INTF_CLA2PF) >> 5U;
             break;
        case CLA_FLAG_CLA3NF:
             intf = (interrupt_flag_register & CLA_INTF_CLA3NF) >> 6U;
             break;
        case CLA_FLAG_CLA3PF:
             intf = (interrupt_flag_register & CLA_INTF_CLA3PF) >> 7U;
             break;
        default:
             intf = 0U;
             break;
    }
    if(intf) {
        retval = SET;
    } else {
        retval = RESET;
    }

    return retval;
}

/*!
    \brief      clear CLA flag
    \param[in]  flag: CLA flags,refer to cla_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CLA_FLAG_CLA0NF: CLA0 unit falling edge flag
      \arg        CLA_FLAG_CLA0PF: CLA0 unit rising edge flag
      \arg        CLA_FLAG_CLA1NF: CLA1 unit falling edge flag
      \arg        CLA_FLAG_CLA1PF: CLA1 unit rising edge flag
      \arg        CLA_FLAG_CLA2NF: CLA2 unit falling edge flag
      \arg        CLA_FLAG_CLA2PF: CLA2 unit rising edge flag
      \arg        CLA_FLAG_CLA3NF: CLA3 unit falling edge flag
      \arg        CLA_FLAG_CLA3PF: CLA3 unit rising edge flag
    \param[out] none
    \retval     none
*/
void cla_flag_clear(cla_flag_enum flag)
{
    switch(flag){
        case CLA_FLAG_CLA0NF:
             CLA_INTF &= ~CLA_INTF_CLA0NF;
             break;
        case CLA_FLAG_CLA0PF:
             CLA_INTF &= ~CLA_INTF_CLA0PF;
             break;
        case CLA_FLAG_CLA1NF:
             CLA_INTF &= ~CLA_INTF_CLA1NF;
             break;
        case CLA_FLAG_CLA1PF:
             CLA_INTF &= ~CLA_INTF_CLA1PF;
             break;
        case CLA_FLAG_CLA2NF:
             CLA_INTF &= ~CLA_INTF_CLA2NF;
             break;
        case CLA_FLAG_CLA2PF:
             CLA_INTF &= ~CLA_INTF_CLA2PF;
             break;
        case CLA_FLAG_CLA3NF:
             CLA_INTF &= ~CLA_INTF_CLA3NF;
             break;
        case CLA_FLAG_CLA3PF:
             CLA_INTF &= ~CLA_INTF_CLA3PF;
             break;
        default:
            break;
    }
}

/*!
    \brief      enable CLA falling edge interrupt
    \param[in]  clanie: CLA falling edge interrupt enable
                only one parameter can be selected which is shown as below:
      \arg        CLA0NIE: CLA0 falling edge interrupt enable
      \arg        CLA1NIE: CLA1 falling edge interrupt enable
      \arg        CLA2NIE: CLA2 falling edge interrupt enable
      \arg        CLA3NIE: CLA3 falling edge interrupt enable
    \param[out] none
    \retval     none
*/
void cla_negedge_interrupt_enable(uint32_t clanie)
{
    CLA_INTE |= clanie;
}

/*!
    \brief      disable CLA falling edge interrupt
    \param[in]  clanidis: CLA falling edge interrupt disable
                only one parameter can be selected which is shown as below:
      \arg        CLA0NI_DISABLE: CLA0 falling edge interrupt disable
      \arg        CLA1NI_DISABLE: CLA1 falling edge interrupt disable
      \arg        CLA2NI_DISABLE: CLA2 falling edge interrupt disable
      \arg        CLA3NI_DISABLE: CLA3 falling edge interrupt disable
    \param[out] none
    \retval     none
*/
void cla_negedge_interrupt_disable(uint32_t clanidis)
{
    CLA_INTE &= ~clanidis;
}

/*!
    \brief      enable CLA rising edge interrupt
    \param[in]  clapie: CLA rising edge interrupt enable
                only one parameter can be selected which is shown as below:
      \arg        CLA0PIE: CLA0 rising edge interrupt enable
      \arg        CLA1PIE: CLA1 rising edge interrupt enable
      \arg        CLA2PIE: CLA2 rising edge interrupt enable
      \arg        CLA3PIE: CLA3 rising edge interrupt enable
    \param[out] none
    \retval     none
*/
void cla_posedge_interrupt_enable(uint32_t clapie)
{
    CLA_INTE |= clapie;
}

/*!
    \brief      disable CLA rising edge interrupt
    \param[in]  clapidis: CLA rising edge interrupt disable
                only one parameter can be selected which is shown as below:
      \arg        CLA0PI_DISABLE: CLA0 rising edge interrupt disable
      \arg        CLA1PI_DISABLE: CLA1 rising edge interrupt disable
      \arg        CLA2PI_DISABLE: CLA2 rising edge interrupt disable
      \arg        CLA3PI_DISABLE: CLA3 rising edge interrupt disable
    \param[out] none
    \retval     none
*/
void cla_posedge_interrupt_disable(uint32_t clapidis)
{
    CLA_INTE &= ~clapidis;
}

/*!
    \brief      check CLA interrupt flag is set or not 
    \param[in]  int_flag: CLA interrupt flags,refer to cla_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CLA_INT_FLAG_CLA0NF: CLA0 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA0PF: CLA0 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA1NF: CLA1 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA1PF: CLA1 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA2NF: CLA2 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA2PF: CLA2 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA3NF: CLA3 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA3PF: CLA3 unit rising edge interrupt flag
    \param[out] none
    \retval     none
*/
FlagStatus cla_interrupt_flag_get(cla_interrupt_flag_enum int_flag)
{
    uint32_t cla_inte = CLA_INTE;
    uint32_t cla_intf = CLA_INTF;
    FlagStatus retval;
    
    switch(int_flag){
        case CLA_INT_FLAG_CLA0NF:
             cla_inte = cla_inte & CLA_INTE_CLA0NIE;
             cla_intf = cla_intf & CLA_INTF_CLA0NF;
             break;
        case CLA_INT_FLAG_CLA0PF:
             cla_inte = cla_inte & CLA_INTE_CLA0PIE;
             cla_intf = cla_intf & CLA_INTF_CLA0PF;
             break;
        case CLA_INT_FLAG_CLA1NF:
             cla_inte = cla_inte & CLA_INTE_CLA1NIE;
             cla_intf = cla_intf & CLA_INTF_CLA1NF;
             break;
        case CLA_INT_FLAG_CLA1PF:
             cla_inte = cla_inte & CLA_INTE_CLA1PIE;
             cla_intf = cla_intf & CLA_INTF_CLA1PF;
             break;
        case CLA_INT_FLAG_CLA2NF:
             cla_inte = cla_inte & CLA_INTE_CLA2NIE;
             cla_intf = cla_intf & CLA_INTF_CLA2NF;
             break;
        case CLA_INT_FLAG_CLA2PF:
             cla_inte = cla_inte & CLA_INTE_CLA2PIE;
             cla_intf = cla_intf & CLA_INTF_CLA2PF;
             break;
        case CLA_INT_FLAG_CLA3NF:
             cla_inte = cla_inte & CLA_INTE_CLA3NIE;
             cla_intf = cla_intf & CLA_INTF_CLA3NF;
             break;
        case CLA_INT_FLAG_CLA3PF:
             cla_inte = cla_inte & CLA_INTE_CLA3PIE;
             cla_intf = cla_intf & CLA_INTF_CLA3PF;
             break;
        default:
             break;
    }
    if((0U != cla_inte) && (0U != cla_intf)){
        retval = SET;
    }else{
        retval = RESET;
    }

    return retval;
}

/*!
    \brief      clear CLA interrupt flag
    \param[in]  int_flag: CLA interrupt flags,refer to cla_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CLA_INT_FLAG_CLA0NF: CLA0 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA0PF: CLA0 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA1NF: CLA1 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA1PF: CLA1 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA2NF: CLA2 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA2PF: CLA2 unit rising edge interrupt flag
      \arg        CLA_INT_FLAG_CLA3NF: CLA3 unit falling edge interrupt flag
      \arg        CLA_INT_FLAG_CLA3PF: CLA3 unit rising edge interrupt flag
    \param[out] none
    \retval     none
*/
void cla_interrupt_flag_clear(cla_interrupt_flag_enum int_flag)
{
    switch(int_flag){
        case CLA_INT_FLAG_CLA0NF:
             CLA_INTF &= ~CLA_INTF_CLA0NF;
             break;
        case CLA_INT_FLAG_CLA0PF:
             CLA_INTF &= ~CLA_INTF_CLA0PF;
             break;
        case CLA_INT_FLAG_CLA1NF:
             CLA_INTF &= ~CLA_INTF_CLA1NF;
             break;
        case CLA_INT_FLAG_CLA1PF:
             CLA_INTF &= ~CLA_INTF_CLA1PF;
             break;
        case CLA_INT_FLAG_CLA2NF:
             CLA_INTF &= ~CLA_INTF_CLA2NF;
             break;
        case CLA_INT_FLAG_CLA2PF:
             CLA_INTF &= ~CLA_INTF_CLA2PF;
             break;
        case CLA_INT_FLAG_CLA3NF:
             CLA_INTF &= ~CLA_INTF_CLA3NF;
             break;
        case CLA_INT_FLAG_CLA3PF:
             CLA_INTF &= ~CLA_INTF_CLA3PF;
             break;
        default:
             break;
    }
}
